In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('Simple_db.db')

In [3]:
cursor = conn.cursor()

In [4]:
cursor.execute(''' SELECT * FROM R ''')
columns = [c[0] for c in cursor.description]
data = cursor.fetchall()
r_df = pd.DataFrame(data, columns = columns)

In [5]:
cursor.execute(''' SELECT * FROM U ''')
columns = [c[0] for c in cursor.description]
data = cursor.fetchall()
u_df = pd.DataFrame(data, columns = columns)

In [6]:
cursor.execute('''
SELECT * FROM R r
    INNER JOIN U u;
''')
columns = [c[0] for c in cursor.description]
data = cursor.fetchall()
data_df = pd.DataFrame(data, columns = columns)

In [7]:
conn.close()

In [8]:
r_df

   A1  A2  A3
0  v1  v2  v3
1  v4  v5  v6

In [9]:
u_df

   C1   C2
0  v5  v11
1  v8  v12

SELECT * FROM R r
    INNER JOIN U u;

In [10]:
data_df

   A1  A2  A3  C1   C2
0  v1  v2  v3  v5  v11
1  v1  v2  v3  v8  v12
2  v4  v5  v6  v5  v11
3  v4  v5  v6  v8  v12